Repository: smakh2004/alochi
Catalog: lib/l10n/intl_*.arb
Languages: uz

# learn6xMore
source: Learn 6x more effectively
uz: 6 baravar samaraliroq o‘rganing

# interactiveLessonsStart
source: A'lochi interactive lessons start at your level and help you advance.
uz: A'lochi interaktiv darslari sizning darajangizdan boshlanadi va rivojlanishingizga yordam beradi.

# continue_button
source: CONTINUE
uz: DAVOM ETISH

source: Morning routine
uz: Ertalabki odat

source: Quick break
uz: Tezkor tanaffus

source: Nightly ritual
uz: Kechki marosim

source: Another time
uz: Boshqa vaqt

# morningMessage
source: Morning math? Brilliant! Let’s kick off your day with brain power.
uz: Ertalab matematika? Zo‘r! Kuningizni aql bilan boshlaymiz.

# quickBreakMessage
source: Smart choice! A quick math break is a great mental refresh.
uz: Aqlli tanlov! Tezkor tanaffus miyaning dam olishi uchun juda mos.

# nightlyMessage
source: Perfect! Wind down your day with relaxing problem-solving.
uz: Ajoyib! Kunningizni yengil masalalar bilan yakunlang.

# anotherTimeMessage
source: No worries! We’ll be here whenever you’re ready to learn.
uz: Xavotir olmang! Siz tayyor bo‘lganda biz shu yerdamiz.

# chooseBestTime
source: Choose best time to learn math?
uz: Matematika o‘rganish uchun eng yaxshi vaqtni tanlang?

source: Get rewards for study
uz: O‘qish uchun mukofotlar oling

# alochiKeepsYouOnTrack
source: A'lochi keeps you on track - with lessons, puzzles, and daily motivation designed for you.
uz: A'lochi sizni darslar, boshqotirmalar va siz uchun mo‘ljallangan kundalik motivatsiya bilan yo‘lda ushlab turadi.

# personalizedLearningPath
source: Your personalized learning path is ready.
uz: Sizning shaxsiylashtirilgan o‘quv yo‘lingiz tayyor.

# createFreeProfile
source: Create a free profile
uz: Bepul profil yarating

source: Try a lesson
uz: Bir darsni sinab ko‘ring

# hint1
source: Subtraction means taking away. Sample: If you have 3 things and you take away 2, count what’s left: • Start with 3 fingers. • Put down 2 fingers. • How many fingers are still up? Think: 3… take away 1 (now 2)… take away 1 more (now 1).
uz: Ayirish degani olib tashlash degani. Namuna: Agar sizda 3 ta narsa bo‘lsa va 2 tasini olib tashlasangiz, qolganini sanang: • 3 ta barmoq bilan boshlang. • 2 ta barmoqni tushiring. • Nechta barmoq qoldi? O‘ylang: 3… 1 ni olib tashlang (endi 2)… yana 1 ni olib tashlang (endi 1).

# hint2
source: When we look at two numbers, we often want to know how they relate to each other. There are three main symbols we use: 1. Equal sign "=" means “is equal to” or “is the same as.” Use it when both sides have the same value. 2. Less than sign "<" means “is less than.” The number on the left is smaller than the number on the right. 3. Greater than sign ">" means “is greater than.” The number on the left is bigger than the number on the right. Memory Trick Think of the symbols "<" and ">" like a hungry mouth: The mouth opens toward the bigger number because it wants to eat the larger one.
uz: Ikki sonni ko‘rganimizda, ko‘pincha ular bir-biriga qanday munosabatda ekanini bilmoqchi bo‘lamiz. Biz uchta asosiy belgidan foydalanamiz: 1. Tenglik belgisi "=" — “teng” yoki “bir xil” degani. Ikkala tomonning qiymati bir xil bo‘lsa, ishlatiladi. 2. Kichik belgisi "<" — “kichikroq” degani. Chap tomondagi son o‘ng tomondagidan kichik bo‘ladi. 3. Katta belgisi ">" — “katta” degani. Chap tomondagi son o‘ng tomondagidan katta bo‘ladi. Eslab qolish uchun maslahat: "<" va ">" belgilarini och qolgan og‘iz deb tasavvur qiling: Og‘iz katta tomonga qaragan bo‘ladi, chunki u kattaroq sonni yeb qo‘ymoqchi bo‘ladi.

# hint3
source: Look carefully at each line. Each picture stands for a number. Try to find the value of each picture step by step! Sample:
uz: Har bir qatorga diqqat bilan qarang. Har bir rasm biror sonni bildiradi. Har bir rasmning qiymatini bosqichma-bosqich topishga harakat qiling! Namuna:

# hint4
source: Advice: Slow down and observe carefully. Look for patterns, differences, or hidden details. Move your eyes across the whole image instead of focusing on one spot. Sometimes the key is in small details that first seem unimportant.
uz: Tavsiya: Sekinroq qarang va diqqat bilan kuzating. Namunalar, farqlar yoki yashirin detallarni izlang. Ko‘zingizni faqat bitta joyga emas, butun rasm bo‘ylab yurgizing. Ba’zan kalit bir qarashda ahamiyatsiz tuyuladigan kichik detallarda bo‘ladi.
