Repository: smakh2004/alochi
Catalog: lib/l10n/intl_*.arb
Languages: uz

# langauage
source: English
uz: O'zbekcha

# akkaunt
source: I HAVE AN ACCOUNT
uz: MENDA AKKAUNT BOR

# intro
source: This app helps you deeply understand mathematics. Geometric figures will support you along the way.
uz: Bu ilova sizning matematikani chuqur o'zlashtirishizga yordam beradi. Sizni yo'l davomida geometrik figuralar qo'lab quvatlab boradi.

# intro2desc
source: WIN STREAK
uz: G'ALABALI SERIYA

# intro2
source: Each step here leads to success. Ahead of you are exciting challenges, achievements, and rewards. Are you ready to begin?
uz: Bu yerda har bir qadam — muvaffaqiyat sari. Sizni oldingizda qiziqarli sinovlar, yutuqlar va mukofotlar kutmoqda. Boshlashga tayyormisiz?

# intro3desc
source: PURPOSE
uz: MAQSAD

# intro3
source: The purpose of the app is to make learning mathematics easy and understandable. At each stage, you’ll be supported by engaging examples and visual helpers.
uz: Ilovaning maqsadi — matematikani o‘rganishni oson va tushunarli qilish. Sizga har bosqichda qiziqarli misollar va vizual yordamchilar ko‘maklashadi.

# tizimgaKirish
source: Login
uz: Tizimga kirish

# tizimgaKirishDes
source: We’re very happy to have you back!
uz: Qaytkaningizdan judayam xursandmiz!

source: Email
uz: Pochta

# parol
source: Password
uz: Parol

# kirish
source: LOGIN
uz: KIRISH

# akkauntizYoqmi
source: Don't have an account?
uz: Akkauntiz yo'qmi?

# registratsiyaQilish
source: Sign up
uz: Registratsiya qilish

# googleOrqali
source: -Sign in with Google-
uz: -Google orqali kirish-

# boshlangich
source: Elementary school
uz: Boshlang'ich sinf

# yuqoriSinf
source: High school
uz: Yuqori sinf

# student
source: University
uz: Student

# messageOfMrSquare
source: Choose your math skill level!
uz: Matematika bo'ycha bilim darajangizni tanlang!

# boshlash
source: LET'S GO
uz: BOSHLASH

# davomEtish
source: CONTINUE
uz: DAVOM ETISH

source: START
uz: BOSHLASH

# akkauntLow
source: Accaunt
uz: Akkaunt

source: Parameters
uz: Parametrlar

source: Profile
uz: Profil

source: Notifications
uz: Xabarlar

# kurslar
source: Courses
uz: Kurslar

source: Support
uz: Yordam

source: Help center
uz: Yordam markazi

source: Send feedback
uz: Fikrlarni yuborish

# kvadratQasri
source: Profile Statistics
uz: Profil Statistika

source: SETTINGS
uz: SOZLASH

# settingsNew
source: Settings
uz: Sozlash

# statistika
source: Statistics
uz: Statistika

# arifmetika
source: Arifmetic
uz: Arifmetika

# multiplikativ
source: MULTIPLICATIVE
uz: MULTIPLIKATIV

# logika
source: LOGIC
uz: LOGIKA

# glabaliSeriya
source: WINNING STREAK
uz: G'ALABALI SERIYA

# umumiyOchko
source: TOTAL POINTS
uz: UMUMIY OCHKO

# score
source: Total points
uz: Umumiy ochko

# yutuqlar
source: ACHIEVEMENTS
uz: YUTUQLAR

# hammasiniKorish
source: SEE ALL
uz: HAMMASINI KO'RISH

# TwoFiveYutuqlar
source: Achievements of 2025
uz: 2025 Yildagi Yutuqlar

# kvadratQasriKubogi
source: The Square Castle Cup
uz: Kvadrat Qasri Kubogi

# kvadratQasriKubogiDes
source: Awarded for solving all Mr.Square problems correctly!
uz: Kvadrat misollarni toʻgʻri bajarganingiz uchun.

# galabaliSeriyaBoshlandi
source: Winning streak: activated!
uz: G'alabali seriya boshlandi

# galabaliSeriyaBoshlandiDes
source: Awarded for achieving your first winning streak.
uz: Birinchi g'alabali seriyani qo'lga kiritkaniz uchun.

# tezkor
source: Speedy!
uz: Tezkor

# tezkorDes
source: Awarded for solving the problems in record time.
uz: Misollarni juda tez yechkaningiz uchun.

# yopiqMedal
source: Locked medal
uz: Yopiq Medal

# yopiqMedalDes
source: Medal not unlocked yet.
uz: Bu medal hali ochilmagan.

# TwoSixYutuqlar
source: Achievements of 2026
uz: 2026 Yildagi Yutuqlar

# TwoSevenYutuqlar
source: Achievements of 2027
uz: 2027 Yildagi Yutuqlar

# kvadratQasriBirinchiBosqich
source: LEVEL 1, SQUARE CASTLE
uz: 1 BOSQICH, KVADRAT QASRI

# kvadratQasriBirinchiBosqichDes
source: World of numbers
uz: Sonlar olamiga sayohat

# uchburchakPiramidasiIkkinchiBosqich
source: LEVEL 2, TRIANGLE CASTLE
uz: 2 BOSQICH, UCHBURCHAK QASRI

# uchburchakPiramidasiIkkinchiBosqichDes
source: The secret of math operations
uz: Matematik amallar sirlari

# uchburchakQasri
source: Triangle Castle
uz: Uchburchak Qasri

# doiraQasriUchinchiBosqich
source: LEVEL 3, CIRCLE CASTLE
uz: 3 BOSQICH, DOIRA QASRI

# doiraQasriUchinchiBosqichDes
source: World of Fractions and Shapes
uz: Kasrlar va figuralar dunyosi

# doiraQasri
source: Circle Castle
uz: Doira Qasri

# rechargingIn
source: RECHARGING IN: {time}
uz: TIKLANMOQDA: {time}

# kvadratBirinchiBosqichDes
source: Counting, addition-subtraction, recognizing shapes
uz: Sanash, qo‘shish-ayirish, shakllarni tanish

# uchburchakIkkinchiBosqichDes
source: Multiplication/division, place value, measurements
uz: Ko‘paytirish/bo‘lish, raqamlar xonasi, o‘lchovlar

# matematika
source: Math
uz: Matematika

# magazin
source: Store
uz: Magazin

# magazinNarsalarim
source: My Items
uz: Mening Narsalarim

# jonlarZapasi
source: Hearts Stock
uz: Jonlar Zapasi

# jon
source: Heart
uz: Jon

# savatJon
source: Basket Hearts
uz: Savat Jon

# sandiqJon
source: Chest of Hearts
uz: Sandiq Jon

# kvadratQasriXazinalari
source: Treasures of the Square Castle
uz: Kvadrat Qasri Xazinalari

# kvadratSandiq
source: Square Box
uz: Kvadrat Sandiq

# kvadratVaqt
source: Square Time
uz: Kvadrat Vaqt

# kvadratBust
source: Square Boost
uz: Kvadrat Bust

# sekund
source: second
uz: sekund

# uchburchakPiramidasiXazinalari
source: Treasures of the Triangle Pyramid
uz: Uchburchak Piramidasi Xazinalari

# uchburchakSandiq
source: Triangle Chest
uz: Uchburchak Sandiq

# uchburchakVaqt
source: Triangle Time
uz: Uchburchak Vaqt

# uchburchakBust
source: Triangle Boost
uz: Uchburchak Bust

# miqdori
source: Quantity
uz: Miqdori

# ishlatish
source: Usage
uz: Ishlatish

# narxi
source: Cost
uz: Narxi

# sotibOlish
source: Buy
uz: Sotib Olish

# berilganMisolniYeching
source: Solve the given problem.
uz: Berilgan misolni yeching.

# togriJavob
source: Correct answer!
uz: To'g'ri javob!

# notogriJavob
source: Incorrect answer!
uz: Noto'g'ri javob!

# tekshirish
source: CHECK
uz: TEKSHIRISH

# darstTugashiga
source: Please wait, 1 minute left until the lesson ends!
uz: Iltimos kuting, dars tugashiga 1 daqiqa qoldi!

# darsDavomEtish
source: CONTINUE THE LESSON
uz: DARSNI DAVOM ETIRISH

# chiqish
source: EXIT
uz: CHIQISH

# togriBeliginiTanglang
source: Select the correct sign
uz: To'g'ri belgini tanlang

# pitsaniTeng
source: The pizza is divided into equal parts. How many slices were taken from the plate?
uz: Pitsa teng qismlarga bo'lingan. Likopchadan nechta bo'lak olingan?

# qaysiBirShakl
source: Which shape is divided into equal halves?
uz: Qaysi bir shakl teng yarimga bo'lingan?

# kokKatakchalar
source: Solve the given problem. Only one number fits in the blue boxes.
uz: Berilgan misolni yeching. Ko'k katakchalar o'rniga bittagina son to'g'ri keladi.

# otniTogri
source: Place the horse in the correct square!
uz: Otni to'g'ri kattakga qo'ying!

# joningiztugadi
source: You Lose!
uz: Joningiz tugadi!

# tanafuzQilib
source: Take a break and come back later!
uz: Tanafus qilib keyin qayting!

# uygaQaytish
source: RETURN HOME
uz: UYGA QAYTISH

# ajoyibDars
source: GREAT LESSON!
uz: AJOYIB DARS!

# ochko
source: POINTS
uz: OCHKO

# vaqt
source: TIME
uz: VAQT

# aniqlik
source: ACCURACY
uz: ANIQLIK

# sizniErtagaKutamiz
source: See you tomorrow!
uz: Sizni ertaga kutamiz!

# davomiyYutuq
source: Keep your winning streak!
uz: Davomiy yutiqni saqlang!

# qaysiShakillar
source: Which shapes combine to form a square?
uz: Qaysi shakillar birlashtirilganda, kvadrat xosil bo'ladi?

# azizChizilgan
source: Aziz folds the piece of paper along the drawn line. What does he see?
uz: Aziz chizilgan chiziq bo'ylab qog'oz bo'lagini buklaydi. U nima ko'rdi?

# berilganMisolni
source: Solve the given problem. The blue boxes must be filled with coins of equal value.
uz: Berilgan misolni yeching. Ko'k katakchalar o'rniga bir xil qiymatga ega tangalar to'g'ri keladi.

# torgaQoshib
source: Keep adding 4 and find the last number.
uz: 4-ga qo'shib boring va oxirgi sonni toping.

# notification1
source: Welcome to the Alochi app, get ready to enjoy new challenges!
uz: Alochi dasturiga xush kelibsiz, yangi choqilarni zavt etishga tayyor turing!

# notification2
source: Let's explore the Square Castle together! An exciting adventure awaits us.
uz: Kvadrat qasrini birga o'rganamiz! Bizni qiziqarli sarguzasht kutmoqda.

# notification3
source: Let's go collect the lightning bolts!
uz: Yashinlarni yig'ishga olg'a!

# xabarlar
source: Notifications
uz: Xabarlar

# cheksizJonlar
source: Unlimited hearts
uz: Cheksiz jonlar

# matematikShtorm
source: Math storm
uz: Matematik shtorm

# onePremium
source: 1 month Premium
uz: 1 oy Premium

# threePremium
source: 3 months Premium
uz: 3 oy Premium

# twelvePremium
source: 1 year Premium
uz: 1 yil Premium

# yoqish
source: GET STARTED
uz: YOQISH

# arifmetikStorm
source: Arithmetic storm
uz: Matematik shtorm

# olga
source: LET'S GO
uz: START

source: MATH STORM
uz: MATEMATIK SHTORM

# rekord
source: RECORD
uz: REKORD

# urinishlarSoni
source: Number of attempts:
uz: Urinishlar soni:

# yangiUrinishlar
source: New attempts:
uz: Yangi urinishlar:

# danSong
source: are recovering
uz: dan so‘ng

# minut
source: minutes
uz: minut

# dona
source: hearts
uz: dona

# yangiRekord
source: New record!
uz: Yangi rekord!

# yaxshiUrinish
source: Nice try!
uz: Yaxshi urinish!

# qaytish
source: RETURN
uz: QAYTISH

# agarChiqibKetsangiz
source: If you leave, you will lose one attempt!
uz: Agar chiqib ketsangiz, bitta urinishni yo'qotasiz!

# Ochko
source: Points:
uz: Ochko:

# javobKiriting
source: Enter your answer and set a record.
uz: Javobni kiriting va rekord o'rnating.

# misolUchun
source: For example: -4
uz: Misol uchun: -4

# keyingi
source: NEXT
uz: KEYINGI

# xaliRazrabotkada
source: Soon...
uz: Xali razrabo'tkada

# ortgaQaytish
source: Return
uz: Ortga qaytish

# beshinchiSinf
source: 5th grade
uz: 5 sinf

# naturalSonlar
source: Natural numbers
uz: Natural sonlar

# matnliMasalalar
source: Sample problems
uz: Matnli masalalar

# geometriya
source: Geometry
uz: Geometriya

# oddiyKasrlar
source: Simple fractions
uz: Oddiy kasrlar

# fazoviyShakllar
source: Spatial shapes
uz: Fazoviy shakllar

# onliKasrlar
source: Decimal fractions
uz: O‘nli kasrlar

# malumotlarTahlili
source: Data analysis
uz: Ma’lumotlar tahlili

# oltinchiSinf
source: 6th grade
uz: 6 sinf

# harXilMaxrajliKasrlar
source: Fractions with different denominators
uz: Har xil maxrajli kasrlar

# kasrlarniKopaytirishBolish
source: Multiplication/Division of fractions
uz: Kasrlarni ko‘paytirish/bo‘lish

# nisbatVaProporsiya
source: Ratio and proportion
uz: Nisbat va proporsiya

# butunSonlar
source: Whole numbers
uz: Butun sonlar

# ratsionalSonlar
source: Rational numbers
uz: Ratsional sonlar

# tenglamalar
source: Equations
uz: Tenglamalar

# malumotlarBilanIshlash
source: Working with data
uz: Ma’lumotlar bilan ishlash

# geometrikMaterial
source: Geometric material
uz: Geometrik material

# yakuniyTakrorlash
source: Final review
uz: Yakuniy takrorlash

# yetinchiSinf
source: 7th grade
uz: 7 sinf

# algebraikIfodalar
source: Algebraic expressions
uz: Algebraik ifodalar

# birinchiDarajaliTenglamalar
source: First-degree equations
uz: Birinchi darajali tenglamalar

# birhadlarVaKophadlar
source: Monomials and polynomials
uz: Birhadlar va ko‘phadlar

# kophadniAjratish
source: Factoring polynomials
uz: Ko‘phadni ajratish

# algebraikKasrlar
source: Algebraic fractions
uz: Algebraik kasrlar

# kombinatorika
source: Combinatorics
uz: Kombinatorika

# sakkizinchiSinf
source: 8th grade
uz: 8 sinf

# algebraikKasrlarVaRatsionalIfodalar
source: Algebraic fractions and rational expressions
uz: Algebraik kasrlar va ratsional ifodalar

# darajalarVaIldizlar
source: Powers and roots
uz: Darajalar va ildizlar

# funksiyasi
source: Y = k/x function
uz: Y = k/x funksiyasi

# tengsizliklar
source: Inequalities
uz: Tengsizliklar

# kvadratTenglamalar
source: Quadratic equations
uz: Kvadrat tenglamalar

# taqribiyHisoblashVaXatoliklar
source: Approximate calculations and errors
uz: Taqribiy hisoblash va xatoliklar

# toqqizinchiSinf
source: 9th grade
uz: 9 sinf

# kvadratFunksiyaTaTengsizliklar
source: Quadratic functions and inequalities
uz: Kvadrat funksiya va tengsizliklar

# tenglamalarVaTengsizliklarSistemalari
source: Systems of equations and inequalities
uz: Tenglamalar va tengsizliklar sistemalari

# trigonometriyaAsoslari
source: Basics of trigonometry
uz: Trigonometriya asoslari

# sonliKetmaKetliklar
source: Numerical sequences
uz: Sonli ketma-ketliklar

# ehtimollarVaStatistik
source: Probability and statistics
uz: Ehtimollar va statistik

# emailNotFound
source: No account found with this email
uz: Bunday email topilmadi

# wrongPassword
source: Incorrect password
uz: Parol noto'g'ri

# somethingWentWrong
source: Incorrect email or password
uz: Noto'g'ri email yoki parol

# registratsiya
source: Registered
uz: Registratsiya

# matematikaDunyosi
source: Welcome to the world of math
uz: Matematika dunyosiga olg'a

# parolniTasdiqlash
source: Confirm password
uz: Parolni tasdiqlash

# registratsiyaQilishQ
source: SIGN UP
uz: Registratsiya Qilish

# akkauntizBormi
source: Already have an account?
uz: Akkauntiz bormi?

# tizimgaKirishQ
source: Log in
uz: Tizimga kirish

# sizHaliKirmagansiz
source: You are not signed in yet
uz: Siz hali ro'yxatdan o'tmagansiz

# akkauntgaKirish
source: USE ACCOUNT
uz: AKKAUNTGA KIRISH

# emailAlreadyUsed
source: This email is already registered
uz: Bu email allaqachon ro'yxatdan o'tgan

# emailInvalid
source: The email address is invalid
uz: Email manzili noto‘g‘ri kiritilgan

# weakPassword
source: The password is too weak
uz: Parol juda oddiy

# yanvar
source: January
uz: Yanvar

# fevral
source: February
uz: Fevral

# mart
source: March
uz: Mart

# aprel
source: April
uz: Aprel

# iyun
source: June
uz: Iyun

# iyul
source: July
uz: Iyul

# avgust
source: August
uz: Avgust

# sentabr
source: September
uz: Sentabr

# oktabr
source: October
uz: Oktabr

# noyabr
source: November
uz: Noyabr

# dekabr
source: December
uz: Dekabr

# foydalanuvchi
source: User
uz: Foydalanuvchi

# mehmon
source: Guest
uz: Mehmon

# parolNotogriMsg
source: Passwords do not match
uz: Parollar bir xil emas

# darajaTanlanmadiMsg
source: Please select a level
uz: Iltimos, darajani tanlang

# ismFamiliyaYoqMsg
source: Please enter your first and last name
uz: Iltimos, ism va familiyangizni kiriting

# royxatdanOtildiMsg
source: Registration successful!
uz: Roʻyxatdan oʻtildi!

source: First Name
uz: Ism

source: Last Name
uz: Familiya

# darajaniTanlang
source: Select a level
uz: Darajani tanlang

source: SIGN OUT
uz: AKKAUNTDAN CHIQISH

# noConnection
source: No internet connection
uz: Internet aloqasi yo‘q

# qaytaUrinish
source: Try again
uz: Qayta urinish

source: SAVE
uz: SAQLASH

# emailAlreadyExists
source: This email is already registered
uz: Bu email allaqachon roʻyxatdan oʻtgan

# emailInvalid1
source: The email entered is invalid
uz: Email noto‘g‘ri kiritilgan

# weakPassword1
source: The password is too weak
uz: Parol juda oddiy

# errorOccurred
source: An error occurred:
uz: Xatolik yuz berdi:

# xatolik
source: Error:
uz: Xatolik:

source: User not found
uz: Foydalanuvchi topilmadi

# wrongPassword1
source: Incorrect password
uz: Noto‘g‘ri parol

source: Invalid email format
uz: Email noto‘g‘ri formatda

# unknownError
source: An unknown error occurred
uz: Nomaʼlum xatolik yuz berdi

# mathShtorm
source: Math storm infinity attempts
uz: Matematik shtorm cheksiz urinishlar

# whichPencil
source: Which pencil is the longest?
uz: Eng uzun qalam qaysi?

# findThePerimeter
source: Find the perimeter of a rectangle.
uz: To‘rtburchakning perimetrini toping.

# whichNumberIn
source: Which number is in the triangle and also in the square and also in the circle?
uz: Qaysi son uchburchakda ham, kvadratda ham va doirada ham bor?

source: Hint
uz: Maslahat

source: Square Castle
uz: Kvadrat Qasri

# beast
source: You are beast!
uz: Sen juda zo'rsan!

source: Solution:
uz: Javob:

source: No data found
uz: Hech qanday ma’lumot topilmadi

source: Leaderboard
uz: Reyting jadvali

source: You are in
uz: Siz

source: -place
uz: -chi o'rindasiz

# SizHali
source: You are not in the top 50 yet
uz: Siz hali top-50 talikka kirmagansiz

# weAreBoosting
source: We are boosting your progress!
uz: Biz sizning o'sishingizni tezlashtiramiz!

# getUnlimited
source: Get unlimited hearts and attempts in MathStorm.
uz: Cheksiz jonlar va Matematik shtormda cheksiz urinishlarga ega bo‘ling.

source: Offers
uz: Takliflar

source: Box
uz: Sandiq

# BoxDesc
source: Open the box and find the elements that will help you in the game
uz: Sandiqni oching va o'yinda yordam beradigan elementlarni toping

source: OPEN
uz: OCHISH

source: Big Box
uz: Kotta sandiq

# BigBoxDesc
source: Open the big box and get more elements that will help you in the game.
uz: Kotta sandiqni oching va o'yinda yordam beradigan ko'proq elemetlarga ega bo'ling.

# streak
source: Lightning streak
uz: Yashinli yutuq seriyasi

source: Freezing
uz: Muzlatish

# freezingDesc
source: Freeze your lightning streak in case you miss a class.
uz: Agar biror darsni qoldirib yuborsangiz, yashin seriyangizni muzlatib qo‘ying.

source: Gems
uz: Olmos

# cheksizJonlarDesc
source: A'lochi Infinity: don't worry about your hearts!
uz: A'lochi Infinity: jonlar haqida havotir olmang!

source: LET'S TRY
uz: URINIB KO'RISH

source: Hearts
uz: Jonlar

# heartsDesc
source: Restore maximum hearts and don't worry about the mistakes you made!
uz: Jonlaringizni to‘liq tiklang va qilgan xatolaringiz haqida qayg‘urmang!

# fullHearts
source: FULL HERTS
uz: JONLAR TO'LIQ

source: GET STARTED FOR
uz: BOSHLASH NARXI

source: NO, THANKS
uz: YO'Q, RAXMAT

# refillYourGems
source: Refill your gems, to continue!
uz: Olmoslarni to'ldiring, davom etish uchun!

source: amount
uz: miqdori

source: price
uz: narxi

source: BUY GEMS
uz: SOTIB OLISH

# returnH
source: RETURN
uz: QAYTISH

# keepYourWinStreakSafe
source: Keep your new streak safe!
uz: Yangi g‘alaba seriyangizni saqlang!

# eachFreeze
source: Each Freezing protects your streak for a day. You have
uz: Har bir muzlatish seriyangizni bir kun davomida himoya qiladi. Sizda mavjud:

# ofTwoEquiped
source: of 2 equipped
uz: ta 2 dan

# refilYourFreeze
source: REFILL STREAK FREEZING
uz: SERIYANI TO‘LDIRISH

source: USE
uz: FOYDALANISH

source: ACTIVATED:
uz: YOQILGAN:

source: REFILL HEARTS
uz: JON TO‘LDIRISH

# gemsAndFreezer
source: gems and a FREEZER!
uz: ta olmos va MUZLATISH!

# keep
source: Keep learning by buying boosts for gems
uz: Olmos evaziga o'yin elementlarni xarid qiling

# freezerSave
source: Freezers save your lightinings from running out!
uz: Muzlatish - yashin yutuqlar tugab qolishidan asraydi!

# continueE
source: CONTINUE
uz: DAVOM ETISH

# taOlmos
source: gems!
uz: ta olmos qo'lga kiritdingiz!

# gemsAndStorm
source: gems and an extra MathStorm attempt!
uz: ta olmos va MathStorm urinish!

# gemsAndHeart
source: gems and an extra heart!
uz: ta olmos va Jon!

source: You got
uz: Sizda

# additionalMathStorm
source: Additional storm attempt to challenge yourself!
uz: O‘zingizni sinab ko‘rish uchun qo‘shimcha MathStorm urinish!

# additionalHeart
source: You've earned an additional heart to keep going!
uz: Davom ettirish uchun qo‘shimcha Jon qo‘lga kiritdingiz!

source: Set this time.
uz: Berilgan vaqtni ko'rsating.

# cm
source: cm on the ruler!
uz: cm ni chizg'ichda ko'rsatinng!

source: FOLLOWING
uz: OBUNALAR

source: FOLLOWERS
uz: OBUNACHILAR

source: ADD FRIENDS
uz: DO‘ST QO‘SHISH

# BirinchiBosqich
source: 1 LEVEL
uz: 1 BOSQICH

# KvadratQasri
source: Square Castle
uz: Kvadrat Qasri

# arifmetikaP
source: ARIFMETICS
uz: ARIFMETIKA

source: Answer:
uz: Javob:

# berilganMisollarniYeching
source: Solve the given problems and choose the correct value!
uz: Berilgan misollarni yeching va to‘g‘ri qiymatni tanlang!

# mon
source: Mo
uz: Du

# tue
source: Tu
uz: Se

# wed
source: We
uz: Ch

# thu
source: Th
uz: Pa

# fri
source: Fr
uz: Ju

# sat
source: Sa
uz: Sh

# sun
source: Su
uz: Ya

source: Hi! I am Mr Square!
uz: Salom! Men Mister Kvadratman!

# letsBuildALearningPath
source: Let’s build a learning path just for you.
uz: Keling, faqat siz uchun o‘quv yo‘li tuzamiz.

source: What's your top goal?
uz: Sizning asosiy maqsadingiz nima?

# continueButton
source: CONTINUE
uz: DAVOM ETISH

# goalOption1
source: Professional growth
uz: Kasbiy o‘sish

# goalOption2
source: Staying sharp
uz: Aqliy chaqqonlikni saqlash

# goalOption3
source: Excelling in school
uz: Maktabda yuqori natijalar

# goalOption4
source: Helping my child learn
uz: Farzandimni o‘qitishga yordam berish

# goalOption5
source: Helping my students learn
uz: O‘quvchilarimni o‘qitishga yordam berish

# goalOption6
source: Something else
uz: Boshqa narsalar

# goalMsg1
source: Great choice! Let's boost your professional skills step by step.
uz: Ajoyib tanlov! Kasbiy ko‘nikmalaringizni bosqichma-bosqich oshiramiz.

# goalMsg2
source: Love the motivation! We'll keep your mind sharp and active.
uz: Motivatsiya juda yaxshi! Aqlingizni chaqqon va faol tutamiz.

# goalMsg3
source: Let’s aim high! We’ll help you excel in every subject.
uz: Yuqoriga intilaylik! Har bir fanda sizni yetuk qilamiz.

# goalMsg4
source: Wonderful! We’ll guide your child’s learning journey with fun challenges.
uz: Zo‘r! Farzandingizning o‘qishini qiziqarli mashqlar bilan qo‘llab-quvvatlaymiz.

# goalMsg5
source: Fantastic! Let’s make your teaching even more impactful.
uz: Ajoyib! Darslaringizni yanada samarali qilamiz.

# goalMsg6
source: No problem! We’ll personalize the experience just for you.
uz: Muammo emas! Siz uchun maxsus o‘quv yo‘lini tuzamiz.

# focus_question
source: What do you want to focus on?
uz: Siz nimaga e’tibor qaratmoqchisiz?

# focus_learning_specific_skills
source: Learning specific skills
uz: Muayyan ko‘nikmalarni o‘rganish

# focus_following_curiosity
source: Following my curiosity
uz: Qiziqishimni ergashish

# focus_building_problem_solving
source: Building my problem solving skills
uz: Muammolarni hal qilish ko‘nikmalarini rivojlantirish

# focus_brushing_basics
source: Brushing up on the basics
uz: Asoslarni qayta o‘rganish

# focus_something_else
source: Something else
uz: Boshqa narsalar

# msg_learning_specific_skills
source: Perfect! We’ll focus on the skills that matter most to you.
uz: Ajoyib! Siz uchun eng muhim ko‘nikmalarga e’tibor qaratamiz.

# msg_following_curiosity
source: Curiosity is the best guide — let’s explore together!
uz: Qiziqish eng yaxshi yo‘lboshchi — birga o‘rganamiz!

# msg_building_problem_solving
source: Awesome! Get ready to tackle fun, brain-boosting challenges.
uz: Zo‘r! Qiziqarli va miyaning ishlashini yaxshilovchi topshiriqlar kutmoqda.

# msg_brushing_basics
source: Great! We'll help you build a strong foundation step by step.
uz: Ajoyib! Mustahkam poydevor qurishda sizga bosqichma-bosqich yordam beramiz.

# msg_something_else
source: No worries! We’ll personalize your learning experience for whatever you need.
uz: Xavotir olmang! Siz uchun shaxsiy o‘quv rejasi tuzamiz.

# youWillFit
source: You'll fit right in
uz: Siz bu yerga juda mos kelasiz

# useAlochi
source: Use A'lochi to supercharge your skill sets.
uz: Ko‘nikmalaringizni kuchaytirish uchun A'lochi'dan foydalaning.

# math_level_question
source: How good do you know math?
uz: Matematikani qanchalik yaxshi bilasiz?

# level_elementary
source: Elementary school student
uz: Boshlang‘ich sinf o‘quvchisi

# level_high_school
source: High school student
uz: O‘rta maktab o‘quvchisi

# level_university
source: University student
uz: Universitet talabasi

# dailyGoal
source: What's your daily learning goal?
uz: Sizning kundalik o‘qish maqsadingiz nima?
